In [2]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.2.2
1.26.4

In [4]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)), 
                  columns=cols)
df

    A   B  C   D   E
0   7   9  5  13  12
1  11  13  6   6   7
2   7  12  1  18   3
3  11   5  5   7   5
4   8   7  9  17   9

In [6]:
df.query('A > 10')

    A   B  C  D  E
1  11  13  6  6  7
3  11   5  5  7  5

In [8]:
rerata = df['A'].mean()
rerata

8.8

In [10]:
df.query('A > @rerata')

    A   B  C  D  E
1  11  13  6  6  7
3  11   5  5  7  5